CF/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.СерийныеНомера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Enums/ТипыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/ВидыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыИнформационныхКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смешанная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Comment>(Упр) Магнитные и штриховые карты.</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОпроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоОпроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаДляНакоплений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВладельцаКартыПоШаблону</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/CommonModules/ИнформационныеКартыВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция программно создает новую дисконтную карту.
// Параметры:
//		СтруктураПараметров - Структура - данные для заполнения реквизитов создаваемой карты.
// Возвращаемое значение
//		СсылкаРезультат - СправочникСсылка.ИнформационныеКарты - ссылка на созданную карту
// 			в случае возникновения исключительной ситуации возвращается пустая ссылка.
Функция СоздатьДисконтнуюКарту(СтруктураПараметров) Экспорт
	
	ВыполненоУспешно = Ложь;
	Штрихкод = "";
	
	Попытка
		
		ИнформационнаяКарта = Справочники.ИнформационныеКарты.СоздатьЭлемент();
		ИнформационнаяКарта.Наименование = СтруктураПараметров.КодКарты;
		
		ИнформационнаяКарта.ВидКарты = СтруктураПараметров.ВидКарты;
		ИнформационнаяКарта.ДатаОткрытия = ТекущаяДатаСеанса();
		ИнформационнаяКарта.Родитель = СтруктураПараметров.ГруппаКарты;
		ИнформационнаяКарта.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная;
		
		Если СтруктураПараметров.ВидКарты <> Перечисления.ВидыИнформационныхКарт.Штриховая Тогда
			ИнформационнаяКарта.КодКарты = СтруктураПараметров.КодКарты;
		КонецЕсли;
		
		ИнформационнаяКарта.ВидДисконтнойКарты = СтруктураПараметров.ВидДисконтнойКарты;
		ИнформационнаяКарта.БонуснаяПрограммаЛояльности = СтруктураПараметров.БонуснаяПрограммаЛояльности;
		
		Если СтруктураПараметров.Свойство("ПроводитьОпросВладельцаПриРегистрации")
			И СтруктураПараметров.ПроводитьОпросВладельцаПриРегистрации Тогда
			ИнформационнаяКарта.ДатаСледующегоОпроса = ИнформационнаяКарта.ДатаОткрытия;
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("ГруппаВладельцаКарты") Тогда
			ИнформационнаяКарта.ГруппаВладельцаКартыПоШаблону = СтруктураПараметров.ГруппаВладельцаКарты;
		КонецЕсли;
		
		ИнформационнаяКарта.Записать();
		
		Если СтруктураПараметров.ВидКарты <> Перечисления.ВидыИнформационныхКарт.Магнитная Тогда
			
			МенеджерЗаписи = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Штрихкод = СтруктураПараметров.КодКарты;
			МенеджерЗаписи.Владелец = ИнформационнаяКарта.Ссылка;
			Если ЗначениеЗаполнено(СтруктураПараметров.ТипШтрихкода) Тогда
				МенеджерЗаписи.ТипШтрихкода = СтруктураПараметров.ТипШтрихкода;
			Иначе
				МенеджерЗаписи.ТипШтрихкода = ПодключаемоеОборудованиеРТВызовСервера.ОпределитьТипШтрихкода(СтруктураПараметров.КодКарты);
			КонецЕсли;

			МенеджерЗаписи.Записать(Истина);
			Штрихкод = СтруктураПараметров.КодКарты;
			
		КонецЕсли;
		
		ВыполненоУспешно = Истина;
		
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		ТекстСообщенияОбОшибке = НСтр("ru = 'Ошибка при создании информационной карты: %1'");
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ТекстСообщенияОбОшибке,
									КраткоеПредставлениеОшибки(Инфо));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Маркетинг.Создание дисконтной карты'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			ПодробноеПредставлениеОшибки(Инфо));
		ВыполненоУспешно = Ложь;
		
	КонецПопытки;
	
	СсылкаРезультат = Справочники.ИнформационныеКарты.ПустаяСсылка();
	Если ВыполненоУспешно Тогда
		СсылкаРезультат = ИнформационнаяКарта.Ссылка;
	КонецЕсли;
	
	СтруктураКарты = Новый Структура;
	СтруктураКарты.Вставить("ДанныеПО", СтруктураПараметров.КодКарты);
	СтруктураКарты.Вставить("Штрихкод", Штрихкод);
	СтруктураКарты.Вставить("МагнитныйКод", СтруктураПараметров.КодКарты);
	СтруктураКарты.Вставить("Карта", СсылкаРезультат);
	СтруктураКарты.Вставить("ТипКарты", Перечисления.ТипыИнформационныхКарт.Дисконтная);
	СтруктураКарты.Вставить("ВладелецКарты", Справочники.ФизическиеЛица.ПустаяСсылка());
	СтруктураКарты.Вставить("ЭтоРегистрационнаяКарта", Ложь);
	
	Возврат СтруктураКарты;
	
КонецФункции	

// Функция определяет, нужно ли проводить опрос владельца проверяемой карты на указанную дату.
// Параметры:
//		Карта - СправочникСсылка.ИнформационныеКарты - ссылка на проверяемую карту.
//		ДатаСобытия - Дата - дата проверки.
// Возвращаемое значение
// 		ЕстьНеобходимость - Булево - Истина - нужно проводить опрос, Ложь - иначе.
Функция НеобходимостьОпросаВладельца(Карта, ДатаСобытия) Экспорт
	
	ЕстьНеобходимость = Ложь;
	ПользователюМожноПроводитьОпрос = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(
										ПланыВидовХарактеристик.ПраваПользователей.ПроводитьОпросВладельцевДисконтныхКартПриОформленииДокументов,
										Ложь);
	
	Если ПользователюМожноПроводитьОпрос Тогда
		
		СтруктураРеквизитовКарты = Новый Структура;
		СтруктураРеквизитовКарты.Вставить("ДатаСледующегоОпроса", "ДатаСледующегоОпроса");
		СтруктураРеквизитовКарты.Вставить("ТипКарты", "ТипКарты");
		РеквизитыКарты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Карта, СтруктураРеквизитовКарты);
		ДатаСледующегоОпроса = РеквизитыКарты.ДатаСледующегоОпроса;
		ТипКарты = РеквизитыКарты.ТипКарты;
		
		Если ЗначениеЗаполнено(Карта.ДатаСледующегоОпроса) 
			И ДатаСобытия >= ДатаСледующегоОпроса 
			И ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная Тогда
			
			ЕстьНеобходимость = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьНеобходимость;
	
КонецФункции // НеобходимостьОпросаВладельца()

Функция ТекстЗапросаПоискаКарты(РежимПоискаКарты) Экспорт
	
	Если РежимПоискаКарты = 1 Тогда
		// Поиск по номеру телефона.
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП
		|ПОМЕСТИТЬ Владельцы
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.НомерТелефона = &ВведенноеЧисло
		|	ИЛИ КонтактнаяИнформация.НомерТелефона = &ВведенноеЧислоСВосьмеркой
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка,
		|	КонтактнаяИнформация.НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.НомерТелефона = &ВведенноеЧисло
		|	ИЛИ КонтактнаяИнформация.НомерТелефона = &ВведенноеЧислоСВосьмеркой
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	&ПустойВладелец КАК ВладелецКарты,
		|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП
		|ПОМЕСТИТЬ КартыИзКонтактнойИнформации
		|ИЗ
		|	Справочник.ИнформационныеКарты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	(КонтактнаяИнформация.НомерТелефона = &ВведенноеЧисло
		|	ИЛИ КонтактнаяИнформация.НомерТелефона = &ВведенноеЧислоСВосьмеркой)
		|	И КонтактнаяИнформация.Ссылка.ТипКарты = &ТипКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка,
		|	Владельцы.Ссылка КАК ВладелецКарты,
		|	Владельцы.НомерТелефона КАК НомерТелефона,
		|	Владельцы.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ ТаблицаКарт
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК Карты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Владельцы КАК Владельцы
		|		ПО (Владельцы.Ссылка = Карты.ВладелецКарты)
		|ГДЕ
		|	Карты.ТипКарты = &ТипКарты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыИзКонтактнойИнформации.Ссылка,
		|	КартыИзКонтактнойИнформации.ВладелецКарты,
		|	КартыИзКонтактнойИнформации.НомерТелефона,
		|	КартыИзКонтактнойИнформации.АдресЭП
		|ИЗ
		|	КартыИзКонтактнойИнформации КАК КартыИзКонтактнойИнформации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаКарт.Ссылка,
		|	ТаблицаКарт.ВладелецКарты,
		|	ТаблицаКарт.НомерТелефона,
		|	ТаблицаКарт.АдресЭП
		|ИЗ
		|	ТаблицаКарт КАК ТаблицаКарт";
	ИначеЕсли РежимПоискаКарты = 2 Тогда
		// Поиск по ФИО.
		ТекстЗапроса = "ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Владельцы
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование ПОДОБНО &Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка,
		|	Владельцы.Ссылка КАК ВладелецКарты,
		|	ЕСТЬNULL(КонтактнаяИнформацияВладельца.НомерТелефона, """") КАК НомерТелефона,
		|	ЕСТЬNULL(КонтактнаяИнформацияВладельца.АдресЭП, """") КАК АдресЭП
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК Карты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Владельцы КАК Владельцы
		|		ПО (Владельцы.Ссылка = Карты.ВладелецКарты)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияВладельца
		|		ПО (Владельцы.Ссылка = КонтактнаяИнформацияВладельца.Ссылка)
		|			И (КонтактнаяИнформацияВладельца.Тип В (&ТипыИнформации))
		|ГДЕ
		|	Карты.ТипКарты = &ТипКарты";
		
	ИначеЕсли РежимПоискаКарты = 3 Тогда
		// Поиск по E-mail.
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ Владельцы
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.АдресЭП ПОДОБНО &АдресЭП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка,
		|	КонтактнаяИнформация.НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.АдресЭП ПОДОБНО &АдресЭП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	&ПустойВладелец КАК ВладелецКарты,
		|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ КартыИзКонтактнойИнформации
		|ИЗ
		|	Справочник.ИнформационныеКарты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.АдресЭП ПОДОБНО &АдресЭП
		|	И КонтактнаяИнформация.Ссылка.ТипКарты = &ТипКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка,
		|	Владельцы.Ссылка КАК ВладелецКарты,
		|	Владельцы.НомерТелефона КАК НомерТелефона,
		|	Владельцы.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ ТаблицаКарт
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК Карты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Владельцы КАК Владельцы
		|		ПО (Владельцы.Ссылка = Карты.ВладелецКарты)
		|ГДЕ
		|	Карты.ТипКарты = &ТипКарты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыИзКонтактнойИнформации.Ссылка,
		|	КартыИзКонтактнойИнформации.ВладелецКарты,
		|	КартыИзКонтактнойИнформации.НомерТелефона,
		|	КартыИзКонтактнойИнформации.АдресЭП
		|ИЗ
		|	КартыИзКонтактнойИнформации КАК КартыИзКонтактнойИнформации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаКарт.Ссылка,
		|	ТаблицаКарт.ВладелецКарты,
		|	ТаблицаКарт.НомерТелефона,
		|	ТаблицаКарт.АдресЭП
		|ИЗ
		|	ТаблицаКарт КАК ТаблицаКарт";
	Иначе
		// Поиск по коду карты или штрикоду
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка,
		|	Карты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК Карты
		|ГДЕ
		|	Карты.ТипКарты = &ТипКарты
		|	И Карты.КодКарты = &ВводимоеЧисло
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Штрихкоды.Владелец КАК Ссылка,
		|	Штрихкоды.Владелец.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец.ТипКарты = &ТипКарты
		|	И Штрихкоды.Штрихкод = &ВводимоеЧисло
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
